<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"4805835d66fbd7af31db1b94c32f5cdb1dff8d8fa7de2b659a33dc0f3ad3d8fe","plan_job_ref":"Job .github/workflows/_test-tf.yaml #56 at https://github.com/DND-IT/github-workflows/actions/runs/15378593844","plan_out_hash":"d9674907bd35d3428e914205112fadd0d341908093a93bf3a99653211bfa6824","plan_hash":"ebc6bf238b021bac686d7b5f437a62c84b7a01a5b9b82cdf334c15aa6e82f75a","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #56](https://github.com/DND-IT/github-workflows/actions/runs/15378593844)